# LocationCurve Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mullion..::..LocationCurve Property
Mullion Class See Also
---
This method get the curve location of the current Mullion.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve LocationCurve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LocationCurve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ LocationCurve {
	Curve^ get ();
}
```

# See Also
Mullion Class
Autodesk.Revit.DB Namespace